[{"author":"Luke Hoban","title":"ES6 General Summary","url":"/2015/11/06/es6-general-summary.html","date":"2015-11-06 00:00:00 -0500","summary":"> This post is a copy of [Luke Hoban - ES6Features repo](https://github.com/lukehoban/es6features)      Introduction  ECMAScript 6, also known as ECMAScript 2015, is the latest version of the ECMAScript standard.  ES6 is a significant update to the language, and the first update to the language since ES5 was standardized in 2009. Implementation of these features in major JavaScript engines is [un..."},{"author":"taoalpha","title":"Implement LRU Cache in JavaScript","url":"/2015/11/03/javascript-lru-cache.html","date":"2015-11-03 00:00:00 -0500","summary":"  Introduction    LRU which is short for least recently used is a popular algorithm in cache. The basic idea is always put your items in order of used time, and when you insert new item into the fullfilled chache,remove the least recently used item in your memory.        Implementation      O(n)    At first, I plan to use a hashtable and a list with all keys to achieve it, and I did, but the t..."},{"author":"taoalpha","title":"Array Operation Cost in JavaScript","url":"/2015/10/30/javascript-array-operation-cost.html","date":"2015-10-30 00:00:00 -0400","summary":"  Introduction    `concat()`,`splice()`,`slice()`,`push()`,`pop()`,`shift()`,`unshift()`... all these handy functions belong to Array. We are using them everyday, but do you really know about them ? Time cost of a function in language like JavaScript is not easy to measurement, since different browsers use different javascript engine which will cause different implementation on same functions. Bu..."},{"author":"taoalpha","title":"Sorting Algorithm in JavaScript - Bubble Sort and Merge Sort","url":"/2015/10/29/javascript-sorting-algorithm-2.html","date":"2015-10-29 00:00:00 -0400","summary":"  Introduction    Bubble sort is really cool but not so useful, it seems that you will never use it... But merge sort is really cool since it is really fast.      Bubble Sort    So what is bubble sort, according to wikipedia:    > Bubble sort, sometimes referred to as sinking sort, is a simple sorting algorithm that repeatedly steps through the list to be sorted, compares each pair of adjacent i..."},{"author":"taoalpha","title":"Sorting Algorithm in JavaScript - Insertion Sort and Selection Sort","url":"/2015/10/29/javascript-sorting-algorithm-1.html","date":"2015-10-29 00:00:00 -0400","summary":"  Sorting Algorithm    As the most important and fundamental algorithm, sorting algorithm is always the best start to learn algorithm.    Among all the different sorting algorithms, we have 10 algorithms which are used a lot in practice, and I will introduce all these ten algorithms one by one.     Today we will talk about: Selection Sort and Insertion Sort.      Selection Sort    Selection Sort..."}]