[{"author":"taoalpha","title":"Sorting Algorithm in JavaScript - Bubble Sort and Merge Sort","url":"/2015/10/29/javascript-sorting-algorithm-2.html","date":"2015-10-29 00:00:00 -0400","summary":"  Introduction    Bubble sort is really cool but not so useful, it seems that you will never use it... But merge sort is really cool since it is really fast.      Bubble Sort    So what is bubble sort, according to wikipedia:    > Bubble sort, sometimes referred to as sinking sort, is a simple sorting algorithm that repeatedly steps through the list to be sorted, compares each pair of adjacent i..."},{"author":"taoalpha","title":"Sorting Algorithm in JavaScript - Insertion Sort and Selection Sort","url":"/2015/10/29/javascript-sorting-algorithm-1.html","date":"2015-10-29 00:00:00 -0400","summary":"  Sorting Algorithm    As the most important and fundamental algorithm, sorting algorithm is always the best start to learn algorithm.    Among all the different sorting algorithms, we have 10 algorithms which are used a lot in practice, and I will introduce all these ten algorithms one by one.     Today we will talk about: Selection Sort and Insertion Sort.      Selection Sort    Selection Sort..."},{"author":"taoalpha","title":"Restore your database in Raspberry Pi from kernel panic error","url":"/2015/10/14/raspberry-pi-kernel-panic-data-restore.html","date":"2015-10-14 00:00:00 -0400","summary":"  Background    My Raspberry Pi suddenly stopped running(connection lost when I was connecting with my pi through ssh) when I was doing something really normal(like modifying a file...) And then I tried to connect my pi with a screen and it showed the mysterious Kernel Panic error...      Possible Solutions      From the community    I did some search on google and found some people already me..."},{"author":"taoalpha","title":"Use only JavaScript to send email","url":"/2015/09/30/use-javascript-to-send-email.html","date":"2015-09-30 00:00:00 -0400","summary":"Want to send an email in your static website without any server languages support? Seems impossible. But now you can do that using only JavaScript. Wonderful? I will show you how to do that.      Tools we need    - **Mandrill**: they provide the mail service that you can call using javascript;  - **website**: the website you want to do this;      Preparation    First, you need sign up for [Mandr..."},{"author":"taoalpha","title":"Use Django with Bower and Pipeline","url":"/2015/09/07/django-with-bower-and-pipeline.html","date":"2015-09-07 00:00:00 -0400","summary":"  Intro    Since I decided to focus on python and JS, I started to dig into these two babies.    I use django as my web framework in python, so how to build a website easier is what I most concerned. I used yeoman for a while, pretty amazing and convenient, especially the bower and compressor, compiler.    So I did some search and study, trying to integrate the bower and compressor, compiler into..."}]