[{"author":"taoalpha","title":"First CLI tool with NodeJS","url":"/2015/12/07/my-first-cli-tool-with-nodejs.html","date":"2015-12-07 00:00:00 -0500","summary":"  Introduction    Briefly speaking, NodeJS is like using JS on back-end stuff. Its really cooooooool and exctied for every JS developer !!!    I just started to learn Node, and in order to learn it better, I made a small cli tool for myself, it's quit helpful actually.      Meet Baby    I named this tool as 'baby' with a lot of reasons... :)    What it can do ? It can do a lot and also the power..."},{"author":"taoalpha","title":"感恩","url":"/2015/11/27/thanksgiving.html","date":"2015-11-27 00:00:00 -0500","summary":"我不知道感恩节的历史, 也并没有探究的欲望. 但还是以此为名, 随便写写.    我很感谢我的父母, 他们给了我生命, 而这是让我得以体验这个世界的根本缘由. 还有两个月我满24岁, 至此已来人世两个小轮回, 我庆幸自己始终活着, 走着...    我很感谢我的父亲, 他是我人生最大的偶像, 虽然我从未这么说过. 身为农民的孩子, 他有着坎坷的童年, 那是身在我这个时代, 绝大多数人无法想象的苦楚..."},{"author":"taoalpha","title":"preventDefault and stopPropagation in JS","url":"/2015/11/19/preventDefault-and-stopPropagation-in-JS.html","date":"2015-11-19 00:00:00 -0500","summary":"  Introduction    When we deal with event on DOM, jQuery always very helpful. But javascript has this mechanic called event bubbling is quite annoying. So be careful when you deal with them.      Event Bubbling    We all know DOM elements can be nested inside each other which is great for structure. But it causes some troubles when you want to deal with the event on the children and parent separ..."},{"author":"taoalpha","title":"Strict Mode in JavaScript","url":"/2015/11/11/use-strict-in-js.html","date":"2015-11-11 00:00:00 -0500","summary":"  Introduction    `'use strict'` is a new feature introduced from ECMAScript 5, it is not a subset of js, it has some different semantics from normal code. So be careful to use it.      What is the difference?    After you insert the `'use strict'` into the head of your entire code or in the beginning of the function code.      highlight javascript      // Whole-script strict mode syntax  \"use..."},{"author":"Luke Hoban","title":"ES6 General Summary","url":"/2015/11/06/es6-general-summary.html","date":"2015-11-06 00:00:00 -0500","summary":"> This post is a copy of [Luke Hoban - ES6Features repo](https://github.com/lukehoban/es6features)      Introduction  ECMAScript 6, also known as ECMAScript 2015, is the latest version of the ECMAScript standard.  ES6 is a significant update to the language, and the first update to the language since ES5 was standardized in 2009. Implementation of these features in major JavaScript engines is [un..."}]