{
  "lastupdate":"2015-10-30 00:50:00",
  "puzzles":
  {
    "2015-10-01":
    {
      "18:00:00":
      {
        "title":"In JS, when I create an object with initial value, like {}. How much space the object will have in head ? Will it expand automatically ?",
        "desc":"I am working on implementing all frequently used data structures in JS. When I was doing HashTable, I saw there are two variables: capacity and load factor and one function called rehash() in HashTable of Java. But I don't know how to implement this in JS, seems I don't need to do anything about the memory management.",
        "status":"ongoing",
        "answer":"",
        "author":"taoalpha",
        "other":""
      }
    },
    "2015-09-15":
    {
      "23:30:00":
      {
        "title":"Except callback functions, how to make sure one function execute after another in JS?",
        "desc":"Since JS is single-thread. Sometimes we can not make sure the data processed by another function has already done or not when we want to use it...",
        "status":"ongoing",
        "answer":"",
        "author":"taoalpha",
        "other":""
      }
    },
    "2015-09-09":
    {
      "13:30:00":
      {
        "title":"Why can not use call or apply for setTimeout function to change the scope for setTimeout?",
        "desc":"We can use call and apply to change the scope of a function, but why we can not use it on setTimeout?",
        "status":"check",
        "answer":"setTimeout and setInterval both need a context as window so that it can insert the function into the event queue and evoke it at the right time. So you can use call and apply on setTimeout, setInterval, just don't change the context to something else other than window.",
        "author":"taoalpha",
        "other":""
      },
      "13:50:00":
      {
        "title":"Is there any good-code-habit-guide that encourage all the coders use whatever the language he/she uses?",
        "desc":"We all know some basic, like good and friendly comments, semantic names, but is there any website that summarize all these?",
        "status":"ongoing",
        "answer":"",
        "author":"taoalpha",
        "other":""
      }
    }
  }
}
